package ru.gb.hw;

public class Homework {

  /**
   * 0. Разобрать код, написанный на уроке. Прийти к осознанию, что все написанное - понятно.
   * 1. Сформулировать вопросы, которые остались без ответа, и прислать их в форму сдачи дз.
   * 2. Досдать долги по курсу (т.е. работы, которые еще не сданы).
   * 3.** Дореализовать проект:
   * 3.1 Доработать "отключение клиента" - отсылать всем уведомление о том, что клиент отключился
   * 3.2 Разобраться с префиксами сообщений: навести порядок в консоли (чтобы все было аккуратно и понятно) - на усмотрение студент
   * 4.**** Реализовать "системные" вызовы со стороны клиента:
   * 4.1 /all - получить список всех текущих пользователей
   * 4.2 /exit - отключиться (старый exit удалить)
   */

}
